class DictClass:

    Gan = ["甲", "乙", "丙", "丁", "戊", "己", "庚", "辛", "壬", "癸"]
    Zhi = ["子", "丑", "寅", "卯", "辰", "巳", "午", "未", "申", "酉", "戌", "亥"]

    ShX = ["鼠", "牛", "虎", "兔", "龙", "蛇", "马", "羊", "猴", "鸡", "狗", "猪"]

    numCn = ["零", "一", "二", "三", "四", "五", "六", "七", "八", "九", "十"]

    jqmc = [
        "冬至", "小寒", "大寒", "立春", "雨水", "惊蛰", "春分", "清明", "谷雨", "立夏", "小满", "芒种",
        "夏至", "小暑", "大暑", "立秋", "处暑", "白露", "秋分", "寒露", "霜降", "立冬", "小雪", "大雪"
    ]

    ymc = ["十一", "十二", "正", "二", "三", "四", "五", "六", "七", "八", "九", "十"]

    rmc = [
        "初一", "初二", "初三", "初四", "初五", "初六", "初七", "初八", "初九", "初十", "十一", "十二",
        "十三", "十四", "十五", "十六", "十七", "十八", "十九", "二十", "廿一", "廿二", "廿三", "廿四",
        "廿五", "廿六", "廿七", "廿八", "廿九", "三十", "卅一"
    ]

    ShishenName = [
        "正官", "七杀", "正印", "枭神（倒食）", "比肩", "劫财", "食神", "伤官", "正财", "偏财"
    ]

    Wuxing = ["金", "水", "木", "火", "土"]

    Jijie = ["春季", "夏季", "秋季", "冬季", "四季"]

    WuxingShengwangName = ["旺", "相", "休", "囚", "死"]

    ShierchangshengName = [
        "长生", "沐浴", "冠带", "临官（禄）", "帝旺", "病", "衰", "死", "墓", "绝", "胎", "养"
    ]

    Nayin = {
        '甲子': '海中金',
        '乙丑': '海中金',
        '丙寅': '炉中火',
        '丁卯': '炉中火',
        '戊辰': '大林木',
        '己巳': '大林木',
        '庚午': '路旁土',
        '辛未': '路旁土',
        '壬申': '剑锋金',
        '癸酉': '剑锋金',
        '甲戌': '山头火',
        '乙亥': '山头火',
        '丙子': '涧下水',
        '丁丑': '涧下水',
        '戊寅': '城头土',
        '己卯': '城头土',
        '庚辰': '白腊金',
        '辛巳': '白腊金',
        '壬午': '杨柳木',
        '癸未': '杨柳木',
        '甲申': '泉中水',
        '乙酉': '泉中水',
        '丙戌': '屋上土',
        '丁亥': '屋上土',
        '戊子': '劈雳火',
        '己丑': '劈雳火',
        '庚寅': '松柏木',
        '辛卯': '松柏木',
        '壬辰': '长流水',
        '癸巳': '长流水',
        '甲午': '沙中金',
        '乙未': '沙中金',
        '丙申': '山下火',
        '丁酉': '山下火',
        '戊戌': '平地木',
        '己亥': '平地木',
        '庚子': '壁上土',
        '辛丑': '壁上土',
        '壬寅': '金箔金',
        '癸卯': '金箔金',
        '甲辰': '佛灯火',
        '乙巳': '佛灯火',
        '丙午': '天河水',
        '丁未': '天河水',
        '戊申': '大驿土',
        '己酉': '大驿土',
        '庚戌': '插环金',
        '辛亥': '插环金',
        '壬子': '桑枝木',
        '癸丑': '桑枝木',
        '甲寅': '大溪水',
        '乙卯': '大溪水',
        '丙辰': '沙中土',
        '丁巳': '沙中土',
        '戊午': '天上火',
        '己未': '天上火',
        '庚申': '石榴木',
        '辛酉': '石榴木',
        '壬戌': '大海水',
        '癸亥': '大海水'
    }

    #天干相合（无方向）0甲5巳合化土，1乙6庚合化金，2丙7辛合化水，3丁8壬合化木，4戊9癸合化火
    TgHe = {
        '05': '甲巳合化土',
        '16': '乙庚合化金',
        '27': '7辛合化水',
        '38': '丁壬合化木',
        '49': '戊癸合化火',
        '50': '甲巳合化土',
        '61': '乙庚合化金',
        '72': '7辛合化水',
        '83': '丁壬合化木',
        '94': '戊癸合化火'
    }

    # 天干相冲（无方向）0甲6庚相冲、1乙7辛相冲、8壬2丙相冲、9癸3丁相冲，5戊4己土居中央，故无冲
    # 甲属阳木，为东方，庚属阳金，为西方，阳与阳同类相斥，金与木相克，而且二者方位相反，故曰相冲。其余之干相冲类推。
    TgChong = {
        '06': '甲庚相冲',
        '17': '乙辛相冲',
        '82': '丙壬相冲',
        '93': '丁癸相冲',
        '60': '甲庚相冲',
        '71': '乙辛相冲',
        '28': '丙壬相冲',
        '39': '丁癸相冲'
    }

    # (有方向)0甲克5戊，1乙克4己、5戊克8壬，4己克9癸、8壬克2丙，9癸克3丁、2丙克6庚，3丁克7辛、6庚克0甲，7辛克1乙
    Tgke = {
        '05': '甲木克戊土',
        '14': '乙木克己土',
        '58': '戊土克壬水',
        '49': '己土克癸水',
        '82': '壬水克丙火',
        '93': '癸水克丁火',
        '26': '丙火克庚金',
        '37': '丁火克辛金',
        '60': '庚金克甲木',
        '71': '辛金克乙木'
    }

    # 地支六合(无方向)===========
    # 0子1丑合化土,2寅11亥合化木,3卯10戌合化火,4辰9酉合化金,5巳8申合化水,6午7未合,化土化火
    ZhiHe = {
        '0-1': '子丑合化',
        '2-11': '寅亥合化木',
        '3-10': '卯戌合化火',
        '4-9': '辰酉合化金',
        '5-8': '巳申合化水',
        '6-7': '午未合化土化火',
        '1-0': '子丑合化',
        '11-2': '寅亥合化木',
        '10-3': '卯戌合化火',
        '9-4': '辰酉合化金',
        '8-5': '巳申合化水',
        '7-6': '午未合化土化火'
    }

    # 地支六冲(无方向)=========
    # 0子6午相冲、1丑7未相冲、2寅8申相冲、3卯9酉相冲、4辰10戌相冲、5巳11亥相冲
    ZhiChong = {
        '0-6': '子午相冲',
        '1-7': '丑未相冲',
        '2-8': '寅申相冲',
        '3-9': '卯酉相冲',
        '4-10': '辰戌相冲',
        '5-11': '巳亥相冲',
        '6-0': '子午相冲',
        '7-1': '丑未相冲',
        '8-2': '寅申相冲',
        '9-3': '卯酉相冲',
        '10-4': '辰戌相冲',
        '11-5': '巳亥相冲'
    }

    #地支三合(无方向) 2寅6午10戌三合火;8申0子4辰三合水;11亥3卯7未三合木;5巳9酉1丑三合金;
    ZhiSanhe = {
        '2-6-10': '寅午戌三合火',
        '8-0-4': '申子辰三合水',
        '11-3-7': '亥卯未三合木',
        '5-9-1': '巳酉丑三合金',
        '2-10-6': '寅午戌三合火',
        '8-4-0': '申子辰三合水',
        '11-7-3': '亥卯未三合木',
        '5-1-9': '巳酉丑三合金',
        '6-2-10': '寅午戌三合火',
        '0-8-4': '申子辰三合水',
        '3-11-7': '亥卯未三合木',
        '9-1-5': '巳酉丑三合金',
        '6-10-2': '寅午戌三合火',
        '0-4-8': '申子辰三合水',
        '3-7-11': '亥卯未三合木',
        '9-5-1': '巳酉丑三合金',
        '10-2-6': '寅午戌三合火',
        '4-0-8': '申子辰三合水',
        '7-3-11': '亥卯未三合木',
        '1-9-5': '巳酉丑三合金',
        '10-6-2': '寅午戌三合火',
        '4-8-0': '申子辰三合水',
        '7-11-3': '亥卯未三合木',
        '1-5-9': '巳酉丑三合金'
    }

    # 地支三合半合(无方向) 2寅6午10戌三合火;8申0子4辰三合水;11亥3卯7未三合木;5巳9酉1丑三合金;
    ZhiSanheban = {
        '2-6': '寅午半合火',
        '8-0': '申子半合水',
        '11-3': '亥卯半合木',
        '5-9': '巳酉半合金',
        '6-10': '午戌半合火',
        '0-4': '子辰半合水',
        '3-7': '卯未半合木',
        '9-1': '酉丑半合金',
        '6-2': '寅午半合火',
        '0-8': '申子半合水',
        '11-3': '亥卯半合木',
        '5-9': '巳酉半合金',
        '6-10': '午戌半合火',
        '0-4': '子辰半合水',
        '3-7': '卯未半合木',
        '9-1': '酉丑半合金'
    }

    #地支三会(无方向) 11亥0子1丑北方三会水；2寅3卯4辰东方三会木；5巳6午7未南方三会火；8申9酉10戌西方三会金
    ZhiSanhui = {
        '11-0-1': '亥子丑北方三会水',
        '2-3-4': '寅卯辰东方三会木',
        '5-6-7': '巳午未南方三会',
        '8-9-10': '申酉戌西方三会金',
        '11-1-0': '亥子丑北方三会水',
        '2-4-3': '寅卯辰东方三会木',
        '5-7-6': '巳午未南方三会',
        '8-10-9': '申酉戌西方三会金',
        '0-11-1': '亥子丑北方三会水',
        '3-2-4': '寅卯辰东方三会木',
        '6-5-7': '巳午未南方三会',
        '9-8-10': '申酉戌西方三会金',
        '0-1-11': '亥子丑北方三会水',
        '3-4-2': '寅卯辰东方三会木',
        '6-7-5': '巳午未南方三会',
        '9-10-8': '申酉戌西方三会金',
        '1-0-11': '亥子丑北方三会水',
        '4-3-2': '寅卯辰东方三会木',
        '7-6-5': '巳午未南方三会',
        '10-9-8': '申酉戌西方三会金',
        '1-11-0': '亥子丑北方三会水',
        '4-2-3': '寅卯辰东方三会木',
        '7-5-6': '巳午未南方三会',
        '10-8-9': '申酉戌西方三会金'
    }

    #地支相刑（有方向,因为有1-10，防止成为11-0所以增加分隔符）
    # 7未刑1丑、1丑刑10戌、10戌刑7未，为无恩之刑；2寅刑5巳、5巳刑8申、8申刑2寅，为恃势之刑；0子刑3卯、3卯刑0子，为无礼之刑；44辰、66午、99酉、11亥自刑。
    ZhiXiangxing = {
        '7-1': '未刑丑-无恩之刑',
        '1-10': '丑刑戌-无恩之刑',
        '10-7': '戌刑未-无恩之刑',
        '2-5': '寅刑巳-恃势之刑',
        '5-8': '巳刑申-恃势之刑',
        '8-2': '申刑寅-恃势之刑',
        '0-3': '子刑卯-无礼之刑',
        '3-0': '卯刑子-无礼之刑',
        '4-4': '辰辰自刑',
        '6-6': '午午自刑',
        '9-9': '酉酉自刑',
        '11-11': '亥亥自刑'
    }

    #地支相害（无方向） 0子7未相害、1丑6午相害、2寅5巳相害、3卯4辰相害、8申11亥相害、9酉10戌相害
    ZhiXianghai = {
        '0-7': '子未相害',
        '1-6': '丑午相害',
        '2-5': '寅巳相害',
        '3-4': '卯辰相害',
        '8-11': '申亥相害',
        '9-10': '酉戌相害',
        '7-0': '子未相害',
        '6-1': '丑午相害',
        '5-2': '寅巳相害',
        '4-3': '卯辰相害',
        '11-8': '申亥相害',
        '10-9': '酉戌相害'
    }
