# 十神
SHENX = ('⽐肩', '劫财', '偏印', '正印', '偏官', '正官', '偏财', '正财', '⻝神', '伤官')

# 六神
SHEN6 = ('青龙', '朱雀', '勾陈', '螣蛇', '白虎', '玄武')

# 六亲
QING6 = ("兄弟", "父母", "官鬼", "妻财", "子孙")

# 五行
XING5 = ('木', '火', '土', '金', '水')

# 纳甲
NAJIA = (
    ('甲子寅辰', '壬午申戌'),  # 乾金甲子外壬午 子寅辰午申戌
    ('丁巳卯丑', '丁亥酉未'),  # 兑金丁巳外丁亥 巳卯丑亥酉未
    ('己卯丑亥', '己酉未巳'),  # 离火巳卯外巳酉 卯丑亥酉未巳
    ('庚子寅辰', '庚午申戌'),  # 震木庚子外庚午 子寅辰午申戌
    ('辛丑亥酉', '辛未巳卯'),  # 巽木辛丑外辛未 丑亥酉未巳卯
    ('戊寅辰午', '戊申戌子'),  # 坎水戊寅外戊申 寅辰午申戌子
    ('丙辰午申', '丙戌子寅'),  # 艮土丙辰外丙戌 辰午申戌子寅
    ('乙未巳卯', '癸丑亥酉'),  # 坤土乙未外癸丑 未巳卯丑亥酉
)

GUA64 = {'111111': '乾为天', '111110': '天风姤', '111100': '天山遁', '111000': '天地否', '110000': '风地观', '100000': '山地剥',
         '101000': '火地晋', '101111': '火天大有', '011011': '兑为泽', '011010': '泽水困', '011000': '泽地萃', '011100': '泽山咸',
         '010100': '水山蹇', '000100': '地山谦', '001100': '雷山小过', '001011': '雷泽归妹', '101101': '离为火', '101100': '火山旅',
         '101110': '火风鼎', '101010': '火水未济', '100010': '山水蒙', '110010': '风水涣', '111010': '天水讼', '111101': '天火同人',
         '001001': '震为雷', '001000': '雷地豫', '001010': '雷水解', '001110': '雷风恒', '000110': '地风升', '010110': '水风井',
         '011110': '泽风大过', '011001': '泽雷随', '110110': '巽为风', '110111': '风天小畜', '110101': '风火家人', '110001': '风雷益',
         '111001': '天雷无妄', '101001': '火雷噬嗑', '100001': '山雷颐', '100110': '山风蛊', '010010': '坎为水', '010011': '水泽节',
         '010001': '水雷屯', '010101': '水火既济', '011101': '泽火革', '001101': '雷火丰', '000101': '地火明夷', '000010': '地水师',
         '100100': '艮为山', '100101': '山火贲', '100111': '山天大畜', '100011': '山泽损', '101011': '火泽睽', '111011': '天泽履',
         '110011': '风泽中孚', '110100': '风山渐', '000000': '坤为地', '000001': '地雷复', '000011': '地泽临', '000111': '地天泰',
         '001111': '雷天大壮', '011111': '泽天夬', '010111': '水天需', '010000': '水地比', }

# 中文数字
NUMCN = ("零", "一", "二", "三", "四", "五", "六", "七", "八", "九", "十")

# 24节气
JIEQI = ("冬至", "小寒", "大寒", "立春", "雨水", "驚蟄", "春分", "清明", "穀雨", "立夏", "小滿",
         "芒種", "夏至", "小暑", "大暑", "立秋", "處暑", "白露", "秋分", "寒露", "霜降", "立冬",
         "小雪", "大雪")

# 卦名
GUAS = ('乾', '兑', '离', '震', '巽', '坎', '艮', '坤')

# 卦五行
GUA5 = (3, 3, 1, 0, 0, 4, 2, 2)

# 爻位
YAOS = ('111', '011', '101', '001', '110', '010', '100', '000')

# 天干
GANS = ('甲', '乙', '丙', '丁', '戊', '己', '庚', '辛', '壬', '癸')

# 地支
ZHIS = ("子", "丑", "寅", "卯", "辰", "巳", "午", "未", "申", "酉", "戌", "亥")

# 地支五行
ZHI5 = (4, 2, 0, 0, 2, 1, 1, 2, 3, 3, 2, 4)

# 旬空
KONG = ("子丑", "寅卯", "辰巳", "午未", "申酉", "戌亥")

# 生肖
SHXS = ("鼠", "牛", "虎", "兔", "龍", "蛇", "馬", "羊", "猴", "雞", "狗", "豬")

# 星期 周
WEEK = ("日", "一", "二", "三", "四", "五", "六")

# 农历月
MONS = ("冬", "腊", "正", "二", "三", "四", "五", "六", "七", "八", "九", "十")

# 农历日
DAYS = ("初一", "初二", "初三", "初四", "初五", "初六", "初七", "初八", "初九", "初十", "十一", "十二",
        "十三", "十四", "十五", "十六", "十七", "十八", "十九", "二十", "廿一", "廿二", "廿三", "廿四",
        "廿五", "廿六", "廿七", "廿八", "廿九", "三十", "卅一")
