# 十神
SHENX = ('⽐肩', '劫财', '偏印', '正印', '偏官', '正官', '偏财', '正财', '⻝神', '伤官')

# 六神
SHEN6 = ('青龙', '朱雀', '勾陈', '螣蛇', '白虎', '玄武')

# 六亲
QING6 = ('兄弟', '父母', '官鬼', '妻财', '子孙')

# 五行
XING5 = ('木', '火', '土', '金', '水')

# 纳甲
NAJIA = (
    ('甲子寅辰', '壬午申戌'),  # 乾金甲子外壬午 子寅辰午申戌
    ('丁巳卯丑', '丁亥酉未'),  # 兑金丁巳外丁亥 巳卯丑亥酉未
    ('己卯丑亥', '己酉未巳'),  # 离火巳卯外巳酉 卯丑亥酉未巳
    ('庚子寅辰', '庚午申戌'),  # 震木庚子外庚午 子寅辰午申戌
    ('辛丑亥酉', '辛未巳卯'),  # 巽木辛丑外辛未 丑亥酉未巳卯
    ('戊寅辰午', '戊申戌子'),  # 坎水戊寅外戊申 寅辰午申戌子
    ('丙辰午申', '丙戌子寅'),  # 艮土丙辰外丙戌 辰午申戌子寅
    ('乙未巳卯', '癸丑亥酉'),  # 坤土乙未外癸丑 未巳卯丑亥酉
)

GONG8 = '乾兑离震巽坎艮坤'

GUA64 = {
    '111111': '乾为天', '011111': '天风姤', '001111': '天山遁', '000111': '天地否', '000011': '风地观', '000001': '山地剥',
    '000101': '火地晋', '111101': '火天大有', '110110': '兑为泽', '010110': '泽水困', '000110': '泽地萃', '001110': '泽山咸',
    '001010': '水山蹇', '001000': '地山谦', '001100': '雷山小过', '110100': '雷泽归妹', '101101': '离为火', '001101': '火山旅',
    '011101': '火风鼎', '010101': '火水未济', '010001': '山水蒙', '010011': '风水涣', '010111': '天水讼', '101111': '天火同人',
    '100100': '震为雷', '000100': '雷地豫', '010100': '雷水解', '011100': '雷风恒', '011000': '地风升', '011010': '水风井',
    '011110': '泽风大过', '100110': '泽雷随', '011011': '巽为风', '111011': '风天小畜', '101011': '风火家人', '100011': '风雷益',
    '100111': '天雷无妄', '100101': '火雷噬嗑', '100001': '山雷颐', '011001': '山风蛊', '010010': '坎为水', '110010': '水泽节',
    '100010': '水雷屯', '101010': '水火既济', '101110': '泽火革', '101100': '雷火丰', '101000': '地火明夷', '010000': '地水师',
    '001001': '艮为山', '101001': '山火贲', '111001': '山天大畜', '110001': '山泽损', '110101': '火泽睽', '110111': '天泽履',
    '110011': '风泽中孚', '001011': '风山渐', '000000': '坤为地', '100000': '地雷复', '110000': '地泽临', '111000': '地天泰',
    '111100': '雷天大壮', '111110': '泽天夬', '111010': '水天需', '000010': '水地比'
}

# 中文数字
NUMCN = ('零', '一', '二', '三', '四', '五', '六', '七', '八', '九', '十')

# 24节气
JIEQI = ('冬至', '小寒', '大寒', '立春', '雨水', '驚蟄', '春分', '清明', '穀雨', '立夏', '小滿',
         '芒種', '夏至', '小暑', '大暑', '立秋', '處暑', '白露', '秋分', '寒露', '霜降', '立冬',
         '小雪', '大雪')

# 卦名
GUAS = ('乾', '兑', '离', '震', '巽', '坎', '艮', '坤')

# 卦五行
GUA5 = (3, 3, 1, 0, 0, 4, 2, 2)

# 爻位
# YAOS = ('111', '011', '101', '001', '110', '010', '100', '000')
YAOS = ('111', '110', '101', '100', '011', '010', '001', '000')

# 天干
GANS = ('甲', '乙', '丙', '丁', '戊', '己', '庚', '辛', '壬', '癸')

# 地支
ZHIS = ('子', '丑', '寅', '卯', '辰', '巳', '午', '未', '申', '酉', '戌', '亥')

# 地支五行
ZHI5 = (4, 2, 0, 0, 2, 1, 1, 2, 3, 3, 2, 4)

# 旬空
KONG = ('子丑', '寅卯', '辰巳', '午未', '申酉', '戌亥')

# 生肖
SHXS = ('鼠', '牛', '虎', '兔', '龍', '蛇', '馬', '羊', '猴', '雞', '狗', '豬')

# 星期 周
WEEK = ('日', '一', '二', '三', '四', '五', '六')

# 农历月
MONS = ('冬', '腊', '正', '二', '三', '四', '五', '六', '七', '八', '九', '十')

# 农历日
DAYS = ('初一', '初二', '初三', '初四', '初五', '初六', '初七', '初八', '初九', '初十', '十一', '十二',
        '十三', '十四', '十五', '十六', '十七', '十八', '十九', '二十', '廿一', '廿二', '廿三', '廿四',
        '廿五', '廿六', '廿七', '廿八', '廿九', '三十', '卅一')

# 六冲卦
CHONG = ['乾', '兑', '离', '震', '巽', '坎', '艮', '坤', '大壮', '无妄']

# 六合卦
LIUHE = ['否', '困', '旅', '豫', '节', '贲', '复', '泰']

# 显示卦标识
SYMBOL = [
    ['━　━', '━━━━', '━　━', '○→', '×→'],
    ['▅▅  ▅▅', '▅▅▅▅▅▅', '▅▅  ▅▅', '○→', '×→'],
    ['▅▅▅  ▅▅▅', '▅▅▅▅▅▅▅▅', '▅▅▅  ▅▅▅', '○→', '×→']
]
